"""在深度学习中，经常出现数组和矩阵的计算。
Numpy是Python中一个非常重要的科学计算库，它提供了一个强大的N维数组对象ndarray，以及对数组进行操作的各种函数和方法。
Numpy的主要功能包括：数组创建、数组操作、数学运算、统计分析等。"""
1.5.1 导入NumPy
import numpy as np # 导入NumPy库并简写为np
1.5.2 生成数组
# 要生成NumPy数组，需要使用np.array()方法（函数）。np.array()接收Python列表作为参数，生成NumPy数组（numpy.ndarray对象）。
x = np.array([1.0,2.0,3.0]) # 生成一维数组
print(x) # 输出：[1. 2. 3.]
type(x) # 输出：<class 'numpy.ndarray'>
1.5.3 NumPy 的算数晕眩
# 下面是NumPy数组的算数运算示例：
x = np.array([1.0,2.0,3.0])
y = np.array([2.0,4.0,6.0])
x + y # 输出：[3. 6. 9.]
x - y # 输出：[-1. -2. -3.]
x * y # 输出：[ 2.  8. 18.]
x / y # 输出：[0.5 0.5 0.5]
# x和y若数组元素个数不同，则会触发广播机制（broadcasting），使得数组的形状相同后再进行运算。
# “对应元素的”英文是“element-wise”，因此NumPy的算数运算是“element-wise”运算。
# NumPy也可以和单一的数值（标量）进行运算，结果是将该数值与数组的每个元素进行运算。称为广播（broadcasting）机制。
x = np.array([1.0,2.0,3.0])
x/2 # 输出：[0.5 1.  1.5]
1.5.4 NumPy 的 N 维数组
# NumPy的ndarray对象可以是多维数组。下面是一个二维数组的
A = np.array([[1,2]，[3,4]])
print(A)
A.shape # 输出：(2, 2)，表示A是一个2行2列的二维数组
A.dtype # 输出：dtype('int64')，表示A的元素类型是int64
'''矩阵的算数运算：'''
B = np.array([[3,0],[0,6]])
A + B # 输出：[[4 2] [3 10]]
A * B # 输出：[[ 3  0] [ 0 24]]，表示对应元素相乘
'''和一维数组一样，二维数组也可以和标量进行运算。（广播机制）'''
print(A*10) # 输出：[[10 20] [30 40]]
# NumPy数组（np.array）可以生成N维数组，数学上称一维为向量，二维为矩阵，三维为张量。N维数组的形状可以通过shape属性获取。
1.5.5 广播
'''NumPy中，形状不同的数组之间也可以进行运算
之前的例子中，在2维数组A和标量10之间进行运算时，NumPy会将标量10广播为与A形状相同的数组，然后再进行运算。'''
'''我们通过一下这个例子看一下广播运算的规则：'''
A = np.array([[1,2],[3.4]])
B = np.array([10,20])
print(A*B) #